# Data Analytics II

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [2]:
df=pd.read_csv('Social_Network_Ads.csv')

In [3]:
df.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [4]:
df.describe()

            User ID         Age  EstimatedSalary   Purchased
count  4.000000e+02  400.000000       400.000000  400.000000
mean   1.569154e+07   37.655000     69742.500000    0.357500
std    7.165832e+04   10.482877     34096.960282    0.479864
min    1.556669e+07   18.000000     15000.000000    0.000000
25%    1.562676e+07   29.750000     43000.000000    0.000000
50%    1.569434e+07   37.000000     70000.000000    0.000000
75%    1.575036e+07   46.000000     88000.000000    1.000000
max    1.581524e+07   60.000000    150000.000000    1.000000

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   User ID          400 non-null    int64
 1   Gender           400 non-null    object
 2   Age              400 non-null    int64
 3   EstimatedSalary  400 non-null    int64
 4   Purchased        400 non-null    int64
dtypes: int64(4), object(1)
memory usage: 15.8+ KB

In [6]:
df.isnull().sum()

User ID            0
Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64

In [7]:
df.duplicated().sum()

0

In [8]:
df.value_counts()

User ID   Gender  Age  EstimatedSalary  Purchased
15815236  Female  45   131000           1            1
15660200  Female  37   71000            0            1
15649668  Male    41   79000            0            1
15651983  Male    34   112000           1            1
15652400  Female  38   50000            0            1
                                                    ..
15733883  Male    47   25000            1            1
15733964  Female  38   50000            0            1
15733973  Female  47   113000           1            1
15734161  Female  37   93000            1            1
15566689  Female  35   57000            0            1
Length: 400, dtype: int64

In [9]:
df['Gender'].value_counts()

Female    204
Male      196
Name: Gender, dtype: int64

In [10]:
df.groupby('Gender')['Purchased'].value_counts()

Gender  Purchased
Female  0            127
        1             77
Male    0            130
        1             66
Name: Purchased, dtype: int64

In [11]:
df['Purchased'].value_counts()

0    257
1    143
Name: Purchased, dtype: int64

In [12]:
df1=pd.get_dummies(df,columns=['Gender'])

In [13]:
df1

      User ID  Age  EstimatedSalary  Purchased  Gender_Female  Gender_Male
0    15624510   19            19000          0              0            1
1    15810944   35            20000          0              0            1
2    15668575   26            43000          0              1            0
3    15603246   27            57000          0              1            0
4    15804002   19            76000          0              0            1
..        ...  ...              ...        ...            ...          ...
395  15691863   46            41000          1              1            0
396  15706071   51            23000          1              0            1
397  15654296   50            20000          1              1            0
398  15755018   36            33000          0              0            1
399  15594041   49            36000          1              1            0

[400 rows x 6 columns]

In [14]:
df.drop('Gender',axis=1,inplace=True)

In [15]:
df

      User ID  Age  EstimatedSalary  Purchased
0    15624510   19            19000          0
1    15810944   35            20000          0
2    15668575   26            43000          0
3    15603246   27            57000          0
4    15804002   19            76000          0
..        ...  ...              ...        ...
395  15691863   46            41000          1
396  15706071   51            23000          1
397  15654296   50            20000          1
398  15755018   36            33000          0
399  15594041   49            36000          1

[400 rows x 4 columns]

In [16]:
df1

      User ID  Age  EstimatedSalary  Purchased  Gender_Female  Gender_Male
0    15624510   19            19000          0              0            1
1    15810944   35            20000          0              0            1
2    15668575   26            43000          0              1            0
3    15603246   27            57000          0              1            0
4    15804002   19            76000          0              0            1
..        ...  ...              ...        ...            ...          ...
395  15691863   46            41000          1              1            0
396  15706071   51            23000          1              0            1
397  15654296   50            20000          1              1            0
398  15755018   36            33000          0              0            1
399  15594041   49            36000          1              1            0

[400 rows x 6 columns]

In [17]:
df2=df1.iloc[:,4:]

In [18]:
df2

     Gender_Female  Gender_Male
0                0            1
1                0            1
2                1            0
3                1            0
4                0            1
..             ...          ...
395              1            0
396              0            1
397              1            0
398              0            1
399              1            0

[400 rows x 2 columns]

In [19]:
new_df=pd.concat((df,df2),axis=1)

In [20]:
new_df

      User ID  Age  EstimatedSalary  Purchased  Gender_Female  Gender_Male
0    15624510   19            19000          0              0            1
1    15810944   35            20000          0              0            1
2    15668575   26            43000          0              1            0
3    15603246   27            57000          0              1            0
4    15804002   19            76000          0              0            1
..        ...  ...              ...        ...            ...          ...
395  15691863   46            41000          1              1            0
396  15706071   51            23000          1              0            1
397  15654296   50            20000          1              1            0
398  15755018   36            33000          0              0            1
399  15594041   49            36000          1              1            0

[400 rows x 6 columns]

In [21]:
li1=['User ID', 'Age', 'EstimatedSalary', 'Gender_Female',
       'Gender_Male','Purchased']

In [22]:
new_df=new_df[li1]

In [23]:
new_df

      User ID  Age  EstimatedSalary  Gender_Female  Gender_Male  Purchased
0    15624510   19            19000              0            1          0
1    15810944   35            20000              0            1          0
2    15668575   26            43000              1            0          0
3    15603246   27            57000              1            0          0
4    15804002   19            76000              0            1          0
..        ...  ...              ...            ...          ...        ...
395  15691863   46            41000              1            0          1
396  15706071   51            23000              0            1          1
397  15654296   50            20000              1            0          1
398  15755018   36            33000              0            1          0
399  15594041   49            36000              1            0          1

[400 rows x 6 columns]

In [24]:
from sklearn.preprocessing import MinMaxScaler

scaler=MinMaxScaler(feature_range=(0,1))
new_df["EstimatedSalary"]=scaler.fit_transform(new_df[['EstimatedSalary']])

In [25]:
new_df

      User ID  Age  EstimatedSalary  Gender_Female  Gender_Male  Purchased
0    15624510   19         0.029630              0            1          0
1    15810944   35         0.037037              0            1          0
2    15668575   26         0.207407              1            0          0
3    15603246   27         0.311111              1            0          0
4    15804002   19         0.451852              0            1          0
..        ...  ...              ...            ...          ...        ...
395  15691863   46         0.192593              1            0          1
396  15706071   51         0.059259              0            1          1
397  15654296   50         0.037037              1            0          1
398  15755018   36         0.133333              0            1          0
399  15594041   49         0.155556              1            0          1

[400 rows x 6 columns]

In [26]:
x1=new_df.iloc[:,1:5]

In [27]:
x1

     Age  EstimatedSalary  Gender_Female  Gender_Male
0     19         0.029630              0            1
1     35         0.037037              0            1
2     26         0.207407              1            0
3     27         0.311111              1            0
4     19         0.451852              0            1
..   ...              ...            ...          ...
395   46         0.192593              1            0
396   51         0.059259              0            1
397   50         0.037037              1            0
398   36         0.133333              0            1
399   49         0.155556              1            0

[400 rows x 4 columns]

In [28]:
y1=new_df.iloc[:,-1:]

In [29]:
y1

     Purchased
0            0
1            0
2            0
3            0
4            0
..         ...
395          1
396          1
397          1
398          0
399          1

[400 rows x 1 columns]

In [30]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x1,y1,test_size=0.20,random_state=1)

In [31]:
print(x_train.shape,y_train.shape,x_test.shape,y_test.shape)

(320, 4) (320, 1) (80, 4) (80, 1)

In [32]:
from sklearn.linear_model import LogisticRegression
lr=LogisticRegression()

In [33]:
lr

LogisticRegression()

In [34]:
lr.fit(x_train,y_train)

C:\Users\Aishwarya\anaconda3\lib\site-packages\sklearn\utils\validation.py:72: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(**kwargs)

LogisticRegression()

In [35]:
y_pred=lr.predict(x_test)

In [36]:
y_pred.shape

(80,)

In [37]:
y_pred[0:10]

array([0, 0, 1, 1, 0, 0, 0, 1, 0, 1], dtype=int64)

In [38]:
y_test[0:10]

     Purchased
398          0
125          0
328          1
339          1
172          0
342          0
197          0
291          1
29           0
284          0

In [39]:
from sklearn.metrics import accuracy_score
print("Accuracy score",accuracy_score(y_test,y_pred))

Accuracy score 0.8625

In [40]:
from sklearn.metrics import confusion_matrix,precision_score,recall_score
print("precision score",precision_score(y_test,y_pred))
print("recall_score",recall_score(y_test,y_pred))

precision score 0.8
recall_score 0.875

In [41]:
print("Confusion matrix:\n",confusion_matrix(y_test,y_pred))
tp,fp,fn,tn=confusion_matrix(y_test,y_pred).ravel()
print(f'Correctly Predicted made Purchase {tp}')
print(f'Falsely Predicted made Purchase {fp}')
print(f'Falsely Predicted made did NOT made Purchase {fn}')
print(f'Correctly Predicted made did NOT made Purchase {tn}')

Confusion matrix:
 [[41  7]
 [ 4 28]]
Correctly Predicted made Purchase 41
Falsely Predicted made Purchase 7
Falsely Predicted made did NOT made Purchase 4
Correctly Predicted made did NOT made Purchase 28

In [42]:
score=lr.score(x_test,y_test)
score

0.8625

In [45]:
from sklearn.metrics import mean_absolute_error,mean_squared_error
mean_absolute_error(y_test,y_pred)

0.1375

In [44]:
mean_squared_error(y_test,y_pred)

0.1375